waveshareteam/ESP32-P4-WIFI6-Touch-LCD-7B/examples/esp-idf/12_usb_extend_screen/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"
# CONFIG_ESP32P4_SELECTS_REV_LESS_V3 is not set
CONFIG_ESP32P4_REV_MIN_300=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_BSP_BOARD_TYPE_FIB=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3
CONFIG_EXAMPLE_LCD_BUF_COUNT=3
CONFIG_LCD_PIXEL_FORMAT_RGB565=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
CONFIG_UAC_SPEAKER_CHANNEL_NUM=2
CONFIG_UAC_MIC_CHANNEL_NUM=2
CONFIG_USB_EXTEND_SCREEN_WIDTH=576
